RawLogFiles/htmlVaporClientWrk2V3.txt
Running 5m test @ http://169.254.140.128:8080/htmlVapor
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.414ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.773ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.62ms  846.43us   6.36ms   67.80%
    Req/Sec    37.80    126.50     1.55k    87.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.54ms
 75.000%    3.15ms
 90.000%    3.76ms
 99.000%    4.86ms
 99.900%    5.66ms
 99.990%    6.20ms
 99.999%    6.36ms
100.000%    6.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.421     0.000000            1         1.00
       1.574     0.100000         1851         1.11
       1.881     0.200000         3705         1.25
       2.119     0.300000         5557         1.43
       2.329     0.400000         7409         1.67
       2.535     0.500000         9254         2.00
       2.643     0.550000        10179         2.22
       2.755     0.600000        11103         2.50
       2.879     0.650000        12030         2.86
       3.013     0.700000        12953         3.33
       3.155     0.750000        13877         4.00
       3.233     0.775000        14335         4.44
       3.313     0.800000        14805         5.00
       3.405     0.825000        15261         5.71
       3.513     0.850000        15723         6.67
       3.623     0.875000        16189         8.00
       3.685     0.887500        16416         8.89
       3.759     0.900000        16652        10.00
       3.843     0.912500        16881        11.43
       3.923     0.925000        17109        13.33
       4.019     0.937500        17342        16.00
       4.081     0.943750        17456        17.78
       4.143     0.950000        17573        20.00
       4.219     0.956250        17691        22.86
       4.299     0.962500        17805        26.67
       4.391     0.968750        17920        32.00
       4.439     0.971875        17980        35.56
       4.491     0.975000        18038        40.00
       4.539     0.978125        18096        45.71
       4.607     0.981250        18154        53.33
       4.683     0.984375        18208        64.00
       4.731     0.985938        18239        71.11
       4.771     0.987500        18266        80.00
       4.819     0.989062        18294        91.43
       4.907     0.990625        18326       106.67
       4.983     0.992188        18353       128.00
       5.011     0.992969        18366       142.22
       5.051     0.993750        18381       160.00
       5.083     0.994531        18395       182.86
       5.143     0.995313        18411       213.33
       5.203     0.996094        18425       256.00
       5.255     0.996484        18431       284.44
       5.299     0.996875        18439       320.00
       5.331     0.997266        18447       365.71
       5.375     0.997656        18453       426.67
       5.407     0.998047        18461       512.00
       5.443     0.998242        18464       568.89
       5.523     0.998437        18468       640.00
       5.583     0.998633        18471       731.43
       5.607     0.998828        18476       853.33
       5.663     0.999023        18478      1024.00
       5.699     0.999121        18480      1137.78
       5.779     0.999219        18482      1280.00
       5.791     0.999316        18484      1462.86
       5.815     0.999414        18486      1706.67
       5.847     0.999512        18487      2048.00
       5.879     0.999561        18488      2275.56
       5.887     0.999609        18489      2560.00
       5.927     0.999658        18490      2925.71
       5.943     0.999707        18491      3413.33
       5.947     0.999756        18492      4096.00
       5.947     0.999780        18492      4551.11
       6.007     0.999805        18493      5120.00
       6.007     0.999829        18493      5851.43
       6.195     0.999854        18494      6826.67
       6.195     0.999878        18494      8192.00
       6.195     0.999890        18494      9102.22
       6.239     0.999902        18495     10240.00
       6.239     0.999915        18495     11702.86
       6.239     0.999927        18495     13653.33
       6.239     0.999939        18495     16384.00
       6.239     0.999945        18495     18204.44
       6.359     0.999951        18496     20480.00
       6.359     1.000000        18496          inf
#[Mean    =        2.619, StdDeviation   =        0.846]
#[Max     =        6.356, Total count    =        18496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19189 requests in 5.00m, 28.71MB read
  Socket errors: connect 0, read 0, write 0, timeout 5328
Requests/sec:     63.96
Transfer/sec:     98.00KB