RawLogFiles/htmlVaporClientWrk2V4.txt
Running 5m test @ http://169.254.140.128:8080/htmlLargeVapor
  2 threads and 100 connections
  Thread calibration: mean lat.: 2.589ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.604ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.63ms  677.24us   6.32ms   69.27%
    Req/Sec    38.81     84.00   333.00     83.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.61ms
 75.000%    3.05ms
 90.000%    3.48ms
 99.000%    4.41ms
 99.900%    5.22ms
 99.990%    5.58ms
 99.999%    6.32ms
100.000%    6.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.577     0.000000            1         1.00
       1.781     0.100000         1852         1.11
       2.057     0.200000         3704         1.25
       2.263     0.300000         5555         1.43
       2.441     0.400000         7414         1.67
       2.611     0.500000         9272         2.00
       2.697     0.550000        10186         2.22
       2.783     0.600000        11111         2.50
       2.869     0.650000        12039         2.86
       2.953     0.700000        12965         3.33
       3.045     0.750000        13874         4.00
       3.103     0.775000        14340         4.44
       3.163     0.800000        14803         5.00
       3.233     0.825000        15268         5.71
       3.305     0.850000        15734         6.67
       3.385     0.875000        16191         8.00
       3.435     0.887500        16422         8.89
       3.483     0.900000        16651        10.00
       3.539     0.912500        16883        11.43
       3.611     0.925000        17111        13.33
       3.687     0.937500        17345        16.00
       3.729     0.943750        17457        17.78
       3.777     0.950000        17575        20.00
       3.823     0.956250        17688        22.86
       3.885     0.962500        17805        26.67
       3.963     0.968750        17920        32.00
       3.991     0.971875        17979        35.56
       4.041     0.975000        18037        40.00
       4.085     0.978125        18092        45.71
       4.155     0.981250        18152        53.33
       4.207     0.984375        18209        64.00
       4.251     0.985938        18239        71.11
       4.303     0.987500        18265        80.00
       4.351     0.989062        18295        91.43
       4.435     0.990625        18326       106.67
       4.491     0.992188        18353       128.00
       4.523     0.992969        18367       142.22
       4.563     0.993750        18381       160.00
       4.599     0.994531        18396       182.86
       4.655     0.995313        18411       213.33
       4.711     0.996094        18424       256.00
       4.759     0.996484        18431       284.44
       4.831     0.996875        18439       320.00
       4.851     0.997266        18446       365.71
       4.923     0.997656        18453       426.67
       5.011     0.998047        18460       512.00
       5.059     0.998242        18464       568.89
       5.075     0.998437        18468       640.00
       5.111     0.998633        18471       731.43
       5.167     0.998828        18475       853.33
       5.219     0.999023        18478      1024.00
       5.227     0.999121        18480      1137.78
       5.267     0.999219        18482      1280.00
       5.315     0.999316        18484      1462.86
       5.339     0.999414        18486      1706.67
       5.343     0.999512        18487      2048.00
       5.375     0.999561        18488      2275.56
       5.387     0.999609        18489      2560.00
       5.395     0.999658        18490      2925.71
       5.427     0.999707        18491      3413.33
       5.439     0.999756        18493      4096.00
       5.439     0.999780        18493      4551.11
       5.439     0.999805        18493      5120.00
       5.439     0.999829        18493      5851.43
       5.579     0.999854        18494      6826.67
       5.579     0.999878        18494      8192.00
       5.579     0.999890        18494      9102.22
       6.315     0.999902        18495     10240.00
       6.315     0.999915        18495     11702.86
       6.315     0.999927        18495     13653.33
       6.315     0.999939        18495     16384.00
       6.315     0.999945        18495     18204.44
       6.319     0.999951        18496     20480.00
       6.319     1.000000        18496          inf
#[Mean    =        2.628, StdDeviation   =        0.677]
#[Max     =        6.316, Total count    =        18496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19202 requests in 5.00m, 27.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 5364
Requests/sec:     64.01
Transfer/sec:     95.20KB